#+SEQ_TODO: REPEAT(r) NEXT(n@/!) TODO(t@/!) WAITING(w@/!) SOMEDAY(s@/!) PROJ(p) | DONE(d@) CANCELLED(c@)
#+SEQ_TODO: GOAL(G) | ACHIEVED(a@) MISSED(m@)
#+STARTUP: nologrepeat
#+TAGS: PHONE(o) COMPUTER(c) SHOPPING(s) URGENT(u)
#+ARCHIVE: %s_archive::
#+COLUMNS: %58ITEM(Task) %7TODO %Effort(Time){:} %6CLOCKSUM(Clock)
#+PROPERTY: Effort_ALL 0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+OPTIONS: d:t \n:t p:t todo:t

* Goals
** GOAL Read at least 1 book every month                     :G@2020_reading:
   DEADLINE: <2020-12-31 Do>
   Added on [2020-09-19 Sa 20:24] - Last reviewed on [2020-09-19 Sa 20:30]
   :SMART:
   :Sense:      Train my brain, learn something new, gain knowledge
   :Measurable: Check if I read at least 12 books at the end of the year
   :Actions:    Read frequently, best on a daily schedule
   :Resources:  Free time to read, interesting books
   :Timebox:    30 minutes up to 1 hour per day
   :END:


* GTD releated things
  :PROPERTIES:
  :ID:       94cc6a5c-d0ca-441c-894a-c894e3700020
  :END:
** REPEAT Weekly Review	private 
   SCHEDULED: <2020-09-20 So ++1w>
   :PROPERTIES:
   :Effort: 0:30
   :LOGGING:  nil
   :RESET_CHECK_BOXES: t
   :LAST_REPEAT: [2020-09-13 So 11:51]
   :ID:       93a255a5-6607-4ebf-9312-3beb490a4956
   :END:
   :CLOCKING:
   CLOCK: [2019-07-28 So 18:56]--[2019-07-28 So 19:28] =>  0:32
   CLOCK: [2019-07-21 So 19:10]--[2019-07-21 So 19:36] =>  0:26
   CLOCK: [2019-07-14 So 16:15]--[2019-07-14 So 16:36] =>  0:21
   CLOCK: [2019-07-07 So 18:25]--[2019-07-07 So 18:52] =>  0:27
   CLOCK: [2019-06-30 So 12:36]--[2019-06-30 So 13:01] =>  0:25
   CLOCK: [2019-06-23 So 14:54]--[2019-06-23 So 15:21] =>  0:27
   CLOCK: [2019-06-16 So 20:05]--[2019-06-16 So 20:28] =>  0:23
   CLOCK: [2019-06-09 So 18:54]--[2019-06-09 So 19:18] =>  0:24
   :END:
   Desired outcome: WR done frequently
   :LOGBOOK:
   - Added: [2017-09-17 So 15:49]
   :END:
   - You might use clock-in & clock-out to record the time for this
  
   WR BOOTUP
   =========
   - [X] Remove all NEW tags from the tasks in the backlog

   GET CLEAN
   =========
   Inbox Zero (Create new tasks if needed):
   - [X] Snail Mail
   - [X] Email
   - [X] Journal 
   - [X] Voicemail, Others
   - [X] Meeting minutes of meetings last week
   - [X] Other referenec material
   Braindump 1:
   - [X] Set a timer for 5 minutes and write down what's in your mind

   CHECK CURRENT
   =============
   Check WAITING actions and do this for each item:
   - [X] Did something get delivered? If so change status to NEXT
   - [X] Postpone reminder if still waiting and its overdue
   Check DELEGATED actions and do this for each item:
   - [X] Is the task finished? If so mark it as DONE
   - [X] Is the task overdue? If so schedule a supportive action
   Check your projects and tasks in detail:
   - [X] Review Project List, is something stuck?
   - [X] See your goals list and the associated actions
   - [X] Browse through your actions and mark finished things DONE or CANCELLED
   - [X] Schedule tasks with no date
   - [X] See your schedule for the next 2 weeks an reschedule if its too full
   Rate your performance, energy and write a journal entry:
   - [X] Check last weeks daily plan on how good the performace was
   - [X] Create short Journal entry of what was bad & good last week

   FUTURE ACTIONS
   ==============
   Prepare for the future:
   - [X] Is a Someday/Maybe becoming a task/project?
   - [X] If a Someday is no longer of interest set it to "Cancelled".
   Braindump 2:
   - [X] Set timer to 5 minutes and start dreaming
   - [X] Put the results into Actions/Someday/Maybe

   WR SHUTDOWN & ARCHIVING
   =======================
   - [X] Go through REPEAT actions and shorten the logbook if needed
   - [ ] Select finished tasks in agenda view and do a bulk archive action



* Music
** REPEAT Practice Bass every 2nd or at least every 3rd day
   SCHEDULED: <2020-09-16 Mi .+2d/3d>
   :PROPERTIES:
   :ID:       1e3aff2d-25dc-4cfc-94a7-b0fb452bf5d2
   :STYLE:    habit
   :END:
   :LOGBOOK:
   - State "DONE"       from "REPEAT"     [2020-09-14 Mo 08:43]
   - State "DONE"       from "REPEAT"     [2020-09-12 Sa 08:43]
   - State "DONE"       from "REPEAT"     [2020-09-08 Di 08:43]
   - State "DONE"       from "REPEAT"     [2020-09-06 So 08:43]
   - State "DONE"       from "REPEAT"     [2020-09-04 Do 08:43]
   - State "DONE"       from "REPEAT"     [2020-09-03 Mi 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-31 Mo 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-29 Sa 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-27 Do 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-25 Di 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-23 So 08:43]
   - State "DONE"       from "REPEAT"     [2020-08-21 Fr 08:43]
   :END:


* Phone Calls                                                         :PHONE:
  :PROPERTIES:
  :ID:       ad4839a3-5e98-41e3-a5e8-ac3108c3079c
  :END:
** NEXT Call Grandma for her birthday
   SCHEDULED: <2020-09-20 So>
   :PROPERTIES:
   :ID:       44641b9d-939b-467f-994e-5959e856e0ee
   :END:
   Desired outcome: Grandma is happy
   Don't forget to thank her for the things
   she did to make you happy. 
   :LOGBOOK:
   - Rescheduled from "[2020-09-17 Do]" on [2020-09-20 So 11:57]
   - State "NEXT"       from "TODO"       [2020-09-04 Fr 20:15] \\
     To make it show up in the custom agenda view
   - Added: [2020-09-04 Fr 20:13]
   :END:


* Maintenance                                                   :MAINTENANCE:
  :PROPERTIES:
  :ID:       c8fc5a99-af9a-43a7-830d-81c6bc230ace
  :END:
** REPEAT Check motor oil in the car
   SCHEDULED: <2020-09-20 So ++12w>
   :PROPERTIES:
   :LOGGING: nil
   :EFFORT:   0:10
   :ID:       2feaf084-be20-47c3-bac2-3de0e63f7527
   :END:
   :CLOCKING:
   CLOCK: [2020-09-09 Mi 14:31]--[2020-09-09 Mi 14:33] =>  0:02
   CLOCK: [2020-09-08 Di 14:45]--[2020-09-08 Di 14:54] =>  0:09
   :END:
   :LOGBOOK:
   - State "REPEAT"     from "TODO"       [2020-08-31 Mo 20:45]
   :END:

** PROJ Repair bicycle                                              :BICYCLE:
   :PROPERTIES:
   :ID:       79f762a0-e115-43f2-9b3d-de3c850160e4
   :END:
<<Bike project>>
*** NEXT Order spare part (chain)                           :SHOPPING:URGENT:
    SCHEDULED: <2020-09-20 So>
    :PROPERTIES:
    :EFFORT:   0:20
    :ID:       186f85cd-d29c-402c-8b79-f01b4338198e
    :END:
    :LOGBOOK:
    - Rescheduled from "[2020-08-31 Mo]" on [2020-09-07 Mo 14:12]
    :END:
    - order it from an online shop
*** TODO Mount chain
    :PROPERTIES:
    :EFFORT:   1:00
    :ID:       2b79d2f2-2222-4b71-bf63-70d5b85938ba
    :END:
    - you need to adjust the gear shifting


* House stuff                                                         :HOUSE:
  :PROPERTIES:
  :ID:       7dc87200-dc8c-43b8-8958-4ae2c751a8da
  :END:
** TODO Window cleaning
   SCHEDULED: <2020-09-19 Sa>
** TODO Mount new wardrobe from Ikea
   SCHEDULED: <2020-09-17 Do>
** DONE Lawn mowing 



* Books to read                                              :G@2020_reading:
  :PROPERTIES:
  :ID:       769c92df-73dd-46bd-ae4a-f84a210d220d
  :END:
** NEXT Book: Chris Guillebeau - The $100 Startup
   SCHEDULED: <2020-09-13 So>
   :PROPERTIES:
   :Author:   Chris Guillebeau
   :Title:    The $100 Startup
   :ID:       1fcbf4c0-ce75-476e-ae98-a298d38638b5
   :END:
   - Recommendedd by: Katrin
   :LOGBOOK:
   - State "NEXT"       from "SOMEDAY"    [2020-09-16 Mi 09:27]
   - Added: [2020-09-04 Fr 20:45]
   :END:


* Passion project
  :PROPERTIES:
  :ID:       635400e8-3b31-4cfb-982c-2cb1aa678a76
  :END:

** TODO Write a book about orgmode
   SCHEDULED: <2020-09-19 Sa>
   :PROPERTIES:
   :ID:       d5422748-1ff0-49d5-8698-9d331d71a2da
   :END:
   :CLOCKING:
   CLOCK: [2020-09-08 Di 14:43]--[2020-09-08 Di 14:53] =>  0:10
   CLOCK: [2020-09-08 Di 14:41]--[2020-09-08 Di 14:42] =>  0:01
   :END:
   Desired outcome: Book is published
   Do not forget to thank Grandma
   :LOGBOOK:
   - Rescheduled from "[2020-09-18 Fr]" on [2020-09-20 So 11:58]
   - Not scheduled, was "[2020-09-19 Sa]" on [2020-09-16 Mi 09:29]
   - Rescheduled from "[2020-09-02 Mi]" on [2020-09-16 Mi 09:28]
   - Added: [2020-09-04 Fr 20:16]
   :END:

** NEXT Implement Application
   SCHEDULED: <2020-09-21 Mo>
   :PROPERTIES:
   :CUSTOM_ID: application
   :ID:       849b0c2e-6b79-43d4-96ee-e246d6147162
   :Depth: Deep 
   :END: 
   :LOGBOOK:
   - Rescheduled from "[2020-09-18 Fr]" on [2020-09-20 So 11:58]
   - Not scheduled, was "[2020-09-23 Mi]" on [2020-09-16 Mi 09:29]
   - Rescheduled from "[2020-09-03 Do]" on [2020-09-16 Mi 09:28]
   :END:
   :CLOCKING:
   CLOCK: [2020-07-31 Mi 19:01]--[2020-07-31 Mi 19:29] =>  0:28
   CLOCK: [2020-07-29 Mo 19:48]--[2020-07-29 Mo 20:17] =>  0:29
   CLOCK: [2020-07-27 Sa 19:48]--[2020-07-27 Sa 20:16] =>  0:28
   CLOCK: [2020-07-25 Do 17:19]--[2020-07-25 Do 17:48] =>  0:29
   CLOCK: [2020-07-23 Di 19:45]--[2020-07-23 Di 20:11] =>  0:26
   CLOCK: [2020-07-21 So 19:41]--[2020-07-21 So 20:08] =>  0:27
   CLOCK: [2020-07-19 Fr 20:52]--[2020-07-19 Fr 21:17] =>  0:25
   CLOCK: [2020-07-17 Mi 20:03]--[2020-07-17 Mi 20:32] =>  0:29
   CLOCK: [2020-07-15 Mo 19:25]--[2020-07-15 Mo 19:56] =>  0:31
   CLOCK: [2020-07-13 Sa 18:34]--[2020-07-13 Sa 19:00] =>  0:26
   CLOCK: [2020-07-11 Do 19:59]--[2020-07-11 Do 20:27] =>  0:28
   CLOCK: [2020-07-09 Di 20:08]--[2020-07-09 Di 20:33] =>  0:25
   CLOCK: [2020-07-07 So 19:47]--[2020-07-07 So 20:14] =>  0:27
   CLOCK: [2020-07-05 Fr 20:40]--[2020-07-05 Fr 21:06] =>  0:26
   CLOCK: [2020-07-03 Mi 19:25]--[2020-07-03 Mi 19:52] =>  0:27
   CLOCK: [2020-07-01 Mo 19:40]--[2020-07-01 Mo 20:05] =>  0:25
   CLOCK: [2020-06-29 Sa 20:17]--[2020-06-29 Sa 20:43] =>  0:26
   CLOCK: [2020-06-27 Do 19:21]--[2020-06-27 Do 19:46] =>  0:25
   :END:



* Other Things
** SOMEDAY Buy a Playstation 5                                    :RADAR:NEW:
   Desired outcome: Decided if I want it
   :LOGBOOK:
   - Added: [2020-09-20 So 13:43]
   :END:
